In [1]:
import json
from pandas import json_normalize

In [3]:
import pandas as pd

In [5]:
data=[{'id':1, 
       'name':{'first':'Coleen', 'last':'Volk'}},
       {'name':{'given':'Mose','family':'Regner'}},
       {'id':2,
       'name':'Faye Raker'}]

In [6]:
pd.json_normalize(data)

    id name.first name.last name.given name.family        name
0  1.0     Coleen      Volk        NaN         NaN         NaN
1  NaN        NaN       NaN       Mose      Regner         NaN
2  2.0        NaN       NaN        NaN         NaN  Faye Raker

In [7]:
data=[{'id':1,
        'name':'cole volk',
        'fitness':{'height':130, 'weight':60}},
        {'name':'mose reg',
        'fitness':{'height':130,'weight':60}},
        {'id':2,
        'name':'raker',
        'fitness':{'height':130,'weight':60}}]

In [10]:
pd.json_normalize(data)

    id       name  fitness.height  fitness.weight
0  1.0  cole volk             130              60
1  NaN   mose reg             130              60
2  2.0      raker             130              60

In [11]:
pd.json_normalize(data, max_level=0)

    id       name                        fitness
0  1.0  cole volk  {'height': 130, 'weight': 60}
1  NaN   mose reg  {'height': 130, 'weight': 60}
2  2.0      raker  {'height': 130, 'weight': 60}

In [13]:
pd.json_normalize(data, max_level=2)

    id       name  fitness.height  fitness.weight
0  1.0  cole volk             130              60
1  NaN   mose reg             130              60
2  2.0      raker             130              60

In [14]:
data=[{'state':'florida',
        'shortname':'FL',
        'info':{'governor':'rick scott'},
        'countries':[{'name':'dade','population':12345},
                    {'name':'broward','population':40000},
                    {'name':'palm beach','population':60000}]},
        {'state':'ohio',
        'shortname':'OH',
        'info':{'governor':'john'}, 
        'countries':[{'name':'summit','population':1234},
                        {'name':'cuya','population':1333}]}]

In [17]:

pd.json_normalize(data)

,state,shortname,countries,info.governor
0,florida,FL,"[{'name': 'dade', 'population': 12345}, {'name...",rick scott
1,ohio,OH,"[{'name': 'summit', 'population': 1234}, {'nam...",john

In [22]:
result=pd.json_normalize(data,'countries',['state','shortname',
                                            ['info','governor']])
result

         name  population    state shortname info.governor
0        dade       12345  florida        FL    rick scott
1     broward       40000  florida        FL    rick scott
2  palm beach       60000  florida        FL    rick scott
3      summit        1234     ohio        OH          john
4        cuya        1333     ohio        OH          john

In [18]:
pd.json_normalize(data, max_level=0)

,state,shortname,info,countries
0,florida,FL,{'governor': 'rick scott'},"[{'name': 'dade', 'population': 12345}, {'name..."
1,ohio,OH,{'governor': 'john'},"[{'name': 'summit', 'population': 1234}, {'nam..."

In [19]:
pd.json_normalize(data, max_level=1)

,state,shortname,countries,info.governor
0,florida,FL,"[{'name': 'dade', 'population': 12345}, {'name...",rick scott
1,ohio,OH,"[{'name': 'summit', 'population': 1234}, {'nam...",john

In [20]:
pd.json_normalize(data, max_level=2)

,state,shortname,countries,info.governor
0,florida,FL,"[{'name': 'dade', 'population': 12345}, {'name...",rick scott
1,ohio,OH,"[{'name': 'summit', 'population': 1234}, {'nam...",john

In [23]:
data={'a':[1,2]}
pd.json_normalize(data,'a')

   0
0  1
1  2

In [24]:
pd.json_normalize(data,'a',record_prefix='Prefix.')

   Prefix.0
0         1
1         2

In [25]:
import itertools

In [27]:
for i in itertools.count(5,5):
    if i==35:
        break
    else:
        print(i,end=' ')

5 10 15 20 25 30

In [34]:
count=0
for i in itertools.cycle('ab'):
    if count>7:
        break 
    else:
        print(i,end=' ')
        count+=1

a b a b a b a b

In [38]:
l=['greeks','for','greeks']
iterators=itertools.cycle(l)
for i in range(6):
    print(next(iterators),end=' ')

greeks for greeks greeks for greeks

In [39]:
print(list(itertools.repeat(25,4)))

[25, 25, 25, 25]

In [40]:
from itertools import product

In [43]:
print(list(product([1,2,3],repeat=3)))

[(1, 1, 1), (1, 1, 2), (1, 1, 3), (1, 2, 1), (1, 2, 2), (1, 2, 3), (1, 3, 1), (1, 3, 2), (1, 3, 3), (2, 1, 1), (2, 1, 2), (2, 1, 3), (2, 2, 1), (2, 2, 2), (2, 2, 3), (2, 3, 1), (2, 3, 2), (2, 3, 3), (3, 1, 1), (3, 1, 2), (3, 1, 3), (3, 2, 1), (3, 2, 2), (3, 2, 3), (3, 3, 1), (3, 3, 2), (3, 3, 3)]

In [45]:
print(list(product(['greeks','for','greeks'],'2',repeat=2)))

[('greeks', '2', 'greeks', '2'), ('greeks', '2', 'for', '2'), ('greeks', '2', 'greeks', '2'), ('for', '2', 'greeks', '2'), ('for', '2', 'for', '2'), ('for', '2', 'greeks', '2'), ('greeks', '2', 'greeks', '2'), ('greeks', '2', 'for', '2'), ('greeks', '2', 'greeks', '2')]

In [46]:
print(list(product('ab',[3,4])))

[('a', 3), ('a', 4), ('b', 3), ('b', 4)]

In [47]:
from itertools import permutations

In [48]:
print(list(permutations('ab')))

[('a', 'b'), ('b', 'a')]

In [56]:
print(list(permutations([1,'greeks'])))

[(1, 'greeks'), ('greeks', 1)]

In [57]:
print(list(permutations([1,'greeks'],1)))

[(1,), ('greeks',)]

In [58]:
print(list(permutations([1,'greeks'],2)))

[(1, 'greeks'), ('greeks', 1)]

In [61]:
print(list(permutations(range(3),3)))

[(0, 1, 2), (0, 2, 1), (1, 0, 2), (1, 2, 0), (2, 0, 1), (2, 1, 0)]

In [62]:
from itertools import combinations

In [68]:
print(list(combinations(['a',2],2)))

[('a', 2)]

In [72]:
print(list(combinations('ab',1)))

[('a',), ('b',)]

In [73]:
print(list(combinations('ab',2)))

[('a', 'b')]

In [74]:
print(list(combinations(range(3),2)))

[(0, 1), (0, 2), (1, 2)]

In [75]:
from itertools import combinations_with_replacement

In [80]:
print(list(combinations_with_replacement('ab',3)))

[('a', 'a', 'a'), ('a', 'a', 'b'), ('a', 'b', 'b'), ('b', 'b', 'b')]

In [83]:
print(list(combinations_with_replacement([1,2],3)))

[(1, 1, 1), (1, 1, 2), (1, 2, 2), (2, 2, 2)]

In [86]:
print(list(combinations_with_replacement(range(3),3)))

[(0, 0, 0), (0, 0, 1), (0, 0, 2), (0, 1, 1), (0, 1, 2), (0, 2, 2), (1, 1, 1), (1, 1, 2), (1, 2, 2), (2, 2, 2)]

In [87]:
import operator

In [88]:
li1=[1,4,5,7]

In [91]:
print(list(itertools.accumulate(li1)))

[1, 5, 10, 17]

In [92]:
print(list(itertools.accumulate(li1,operator.mul)))

[1, 4, 20, 140]

In [93]:
li2=[1,6,5,9]
print(list(itertools.chain(li1,li2)))

[1, 4, 5, 7, 1, 6, 5, 9]

In [94]:
li3=[8,10,5,4]

In [101]:
print(list(itertools.compress('greeksforgreeks',[1, 0, 0, 0, 0, 1, 0, 0])))

['g', 's']

In [111]:
li=[8,10,5,5,4]
print(list(itertools.filterfalse(lambda x:x%2==0, li)))

[5, 5]

In [112]:
print(list(itertools.islice(li,0,4,2)))

[8, 5]